emacs/configuration.org
#+TITLE: Org Mode Configuration
#+AUTHOR: Samin Ahbab
#+PROPERTY: header-args :tangle yes
#+PROPERTY: tangle: "~/OSenv/emacs/configuration.el"

* General
** Shorten yes to y

#+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)

#+END_SRC
** Add to list load Path

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp")
#+END_SRC
** Require package

#+BEGIN_SRC emacs-lisp
(require 'package)
(package-initialize)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
(add-to-list 'package-archives
             '("gnu" . "https://elpa.gnu.org/packages/") t)

(when (not package-archive-contents)
  (package-refresh-contents))
(package-refresh-contents)
  #+END_SRC

  #+RESULTS:

** Don't use lock files (which clutter view of a directory)

#+BEGIN_SRC emacs-lisp
(setq create-lockfiles nil)
(setq backup-directory-alist `(("." . "~/.saves")))
#+END_SRC

#+RESULTS:
: ((. . ~/.saves))

** Other

#+BEGIN_SRC emacs-lisp
  (setq find-file-visit-truename t)
(setq backup-directory-alist '(("." . "~/.saves")))
(global-set-key (kbd "C-c m") 'magit)
(setq find-file-visit-truename t)
  #+END_SRC

  #+RESULTS:
  : t

* Theming/UI
** Font

#+BEGIN_SRC emacs-lisp
(set-frame-font "Hack" nil t)
  #+END_SRC

  #+RESULTS:

** Org

Org mode will behave differently, we want to have as clean an environment as possible. This is not
For example, icons marking bullet points are unnecessary.

Used this as a guide: https://lepisma.xyz/2017/10/28/ricing-org-mode/, who has the same ideas re padding and cleanliness.

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'org-bullets-mode )
(add-hook 'org-mode-hook 'variable-pitch-mode )


(setq org-src-fontify-natively t
    org-src-tab-acts-natively t
    org-confirm-babel-evaluate nil
    org-edit-src-content-indentation 0
    org-startup-indented t
    org-bullets-bullet-list '(" ")
    org-pretty-entities t
    org-hide-emphasis-markers t
    org-hide-leading-starts t

    org-ellipsis "  " ;; folding symbol
    org-agenda-block-separator ""
    org-fontify-whole-heading-line t
    org-fontify-done-headline t
    org-fontify-quote-and-verse-blocks t
   )

  (setq org-hide-emphasis-markers t)

#+END_SRC
#+RESULTS:
: t

*** Padding
I actually am not totally sure if I want  a serif font like this.
#+BEGIN_SRC emacs-lisp
(lambda () (progn
  (setq left-margin-width 0)
  (setq right-margin-width 0)
  (set-window-buffer nil (current-buffer))))

(setq header-line-format "")
#+END_SRC

#+RESULTS:

*** Text

Variable pitch text is better to look at for text. I think it is something to do with kerning.
Fixed pitch is better for code.
This is starting to look a little bit messy. I forgot about the fact that I am quite a heavy roam researcher before I started this.
In any case this is only a problem with the font.

#+BEGIN_SRC emacs-lisp
(custom-theme-set-faces 'user '(variable-pitch ((t
                                                 (:family "ETBembo"
                                                          :height 130))))
                        '(fixed-pitch ((t ( :family "Hack"
                                            :height 90
                                            :weight normal )))))
#+END_SRC
#+RESULTS:

Text colour has been set in org to just be black, underlining in hyperlinks are gone as it is redundant.
backlight.

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'org-faces


  (custom-set-faces '(org-document-title ((t :foreground "#1c1e1f"
                                             :underline nil)))
                    '(org-document-info-keyword ((t :foreground "#1c1e1f"
                                                    :underline nil
                                                    :inherit 'fixed-pitch
                                                    :height 70
                                                    :foreground  "#A0A0A0"
                                                    :bold t)))
                    '(org-document-info ((t :foreground "#1c1e1f")))
                    '(org-todo ((t :background nil
                                   :foreground  "#FB6D4C"
                                   :inherit 'fixed-pitch)))
                    '(org-done ((t :background nil
                                   :foreground "#056644"
                                   :inherit 'fixed-pitch)))
                    '(org-link ((t :underline nil
                                   :foreground "#759194")))
                    '(org-level-1 ((t
                                    (:height 1.4
                                             :foreground "#1c1e1f"))))
                    '(org-level-2 ((t
                                    (:height 1.3
                                             :foreground "#1c1e1f"))))
                    '(org-level-3 ((t
                                    (:height 1.2
                                             :foreground "#1c1e1f"))))
                    '(org-level-4 ((t
                                    (:height 1.0
                                             :foreground "#1c1e1f"))))
                    '(org-level-5 ((t
                                    (:height 1.0
                                             :foreground "#1c1e1f"))))
                    '(org-block-begin-line ((t
                                             (:foreground "#787787"
                                                          :background nil
                                                          :inherit 'fixed-pitch
                                                          :bold t
                                                          :height 70))))
                    '(org-block-end-line ((t
                                           (:foreground "#787787"
                                                        :background nil
                                                        :inherit 'fixed-pitch
                                                        :bold t
                                                        :height 70))))

                    '(org-block ((t
                                  (:background nil
                                               :inherit 'fixed-pitch))))
                    '(org-meta-line ((t
                                      (:inherit 'fixed-pitch
                                                :bold t
                                                :height 70
                                                :foreground "#A0A0A0"))))))
#+END_SRC

#+RESULTS:

** Maximise Real Estate

You will see that this should change in the right proportions

#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-startup-screen t)
(setq inhibit-startup-echo-area-message t)
(setq inhibit-startup-message t)
(setq initial-scratch-message nil)
(setq-default inhibit-splash-screen t)
  #+END_SRC

** Highlight Current Line

#+BEGIN_SRC emacs-lisp
  (add-hook 'after-init-hook 'global-hl-line-mode)
  (global-visual-line-mode t)
(show-paren-mode 1)
  #+END_SRC

  #+RESULTS:
  : t

** Theme

#+BEGIN_SRC emacs-lisp
    (setq sml/no-confirm-load-theme t)
  (load-theme 'spacemacs-light t )

(use-package
  spaceline
  :after (spaceline-emacs-theme)
  :ensure t)

(setq sml/no-confirm-load-theme t)

  #+END_SRC

  #+RESULTS:
  : t

Getting rid of highlighting and background color of code blocks for a cleaner look.


#+RESULTS:

** General Pre Save

#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook 'whitespace-cleanup)
(add-hook 'before-save-hook (lambda()
                              (delete-trailing-whitespace)))

  #+END_SRC

** Dashboard
#+BEGIN_SRC emacs-lisp
  (use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))


  #+END_SRC

* Modes
** Rust
#+BEGIN_SRC emacs-lisp
    (use-package toml-mode)

  (use-package rust-mode
    :hook (rust-mode . lsp))

(use-package cargo
  :hook (rust-mode . cargo-minor-mode))


(add-hook 'rust-mode-hook #'aggressive-indent-mode)


  #+END_SRC

*** LSP

#+BEGIN_SRC emacs-lisp
(setq lsp-rust-server 'rust-analyzer)
  #+END_SRC

*** Flycheck and Company

#+BEGIN_SRC emacs-lisp
  (use-package flycheck-rust
    :config (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))

(add-hook 'rust-mode-hook 'company-mode)
  #+END_SRC
*** Shortcuts
#+BEGIN_SRC emacs-lisp

(add-hook 'rust-mode-hook
          (lambda ()
            (local-set-key (kbd "C-c <tab>") #'rust-format-buffer)))

  #+END_SRC
** Python
*** Init
#+BEGIN_SRC emacs-lisp

(eval-after-load 'python-mode-hook
  (lambda () (local-set-key (kbd "C-c <tab>") 'python-black-buffer)))

  (use-package blacken
    :ensure t
    :config
    (add-hook 'python-mode-hook 'blacken-mode))
#+END_SRC

#+RESULTS:
: t

*** LSP
#+BEGIN_SRC emacs-lisp
(use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred


#+END_SRC
