emacs/configuration.org
** Go
#+BEGIN_SRC emacs-lisp
(defun custom-go-hook ()

  (setq gofmt-command "goimports")
  (add-hook 'before-save-hook 'gofmt-before-save)

  ;; Key bindings specific to go-mode
  (local-set-key (kbd "M-.") 'godef-jump)         ; Go to definition
  (local-set-key (kbd "M-*") 'pop-tag-mark)       ; Return from whence you came
  (local-set-key (kbd "M-p") 'compile)            ; Invoke compiler
  (local-set-key (kbd "M-P") 'recompile)          ; Redo most recent compile cmd
  (local-set-key (kbd "M-]") 'next-error)         ; Go to next error (or msg)
  (local-set-key (kbd "M-[") 'previous-error)     ; Go to previous error or msg

  )

(setq lsp-gopls-staticcheck t)
(setq lsp-eldoc-render-all t)
(setq lsp-gopls-complete-unimported t)
(setq compilation-window-height 14)
(setq lsp-gopls-codelens nil)

(use-package go-mode :mode "\\*\\.go")
(add-hook 'go-mode-hook #'smartparens-mode)
(add-hook 'go-mode-hook 'custom-go-hook)

(add-hook 'go-mode-hook #'aggressive-indent-mode)

#+END_SRC
** Javascript/Typescript
Mainly for React work.
#+BEGIN_SRC emacs-lisp

(defun setup-tide-mode()
  (interactive)
  (tide-setup)
  (flycheck-mode +1)
  (setq flycheck-check-syntax-automatically '(save mode-enabled))
(tide-hl-identifier-mode +1)

  (eldoc-mode +1)

  ;; company is an optional dependency. You have to
  ;; install it separately via package-install
  ;; `M-x package-install [ret] company`
  (company-mode +1))

(use-package tide
  :ensure t
  :after (rjsx-mode company flycheck)
  :hook (rjsx-mode . setup-tide-mode))

(add-hook 'before-save-hook 'tide-format-before-save)

(add-hook 'typescript-mode-hook #'setup-tide-mode)


(use-package web-mode
  :ensure t )

(setq web-mode-content-types-alist '(("jsx" . "\\.js[x]?\\'")))

(defun web-mode-init-hook ()
  "Hooks for Web mode.  Adjust indent."
  (setq web-mode-markup-indent-offset 4))

(use-package rjsx-mode
:ensure t
:mode "\\.js\\'")

(add-hook 'web-mode-hook  'web-mode-init-hook)

(add-hook 'js2-mode-hook #'setup-tide-mode)


(add-to-list 'auto-mode-alist '("\\.jsx\\'" . web-mode))
(add-hook 'web-mode-hook
          (lambda ()
            (when (string-equal "jsx" (file-name-extension buffer-file-name))
              (setup-tide-mode))))
;; configure jsx-tide checker to run after your default jsx checker
(flycheck-add-mode 'javascript-eslint 'web-mode)
#+END_SRC

#+RESULTS:
| javascript-tide | jsx-tide |

*** Prettier
#+BEGIN_SRC emacs-lisp
(use-package add-node-modules-path
  :ensure t)
(use-package prettier
  :ensure t
)


(defun web-mode-init-prettier-hook ()
  (add-node-modules-path)
  (prettier-js-mode))

(add-hook 'web-mode-hook  'web-mode-init-prettier-hook)


#+END_SRC

#+RESULTS:
*** EsLint
#+BEGIN_SRC emacs-lisp
(setq-default flycheck-disabled-checkers
              (append flycheck-disabled-checkers
                      '(javascript-jshint json-jsonlist)))

;; Enable eslint checker for web-mode
(flycheck-add-mode 'javascript-eslint 'web-mode)
;; Enable flycheck globally
(add-hook 'after-init-hook #'global-flycheck-mode)
#+END_SRC

#+RESULTS:
| global-flycheck-mode | org-roam-mode | global-company-mode | smartparens-global-mode | #[0 \300 \207 [dashboard-insert-startupify-lists] 1] | global-hl-line-mode | x-wm-set-size-hint | tramp-register-archive-file-name-handler | table--make-cell-map |

** Cypher
#+BEGIN_SRC emacs-lisp

(use-package cypher-mode
  :ensure t
  :mode "\\.cql")

#+END_SRC
** Terraform
#+BEGIN_SRC emacs-lisp

(lsp-register-client
 (make-lsp-client :new-connection (lsp-stdio-connection '("terraform-ls" "serve"))
                  :major-modes '(terraform-mode)
                  :server-id 'terraform-ls))


(add-hook 'terraform-mode-hook #'lsp)


#+END_SRC

#+RESULTS:
| lsp |

** gql
#+BEGIN_SRC emacs-lisp
(use-package graphql-mode
  :ensure t
  :mode "\\.graphqls?\\'")
#+END_SRC

** Yaml
#+BEGIN_SRC emacs-lisp
(use-package yaml-mode
  :mode (("\\.yaml\\'" . yaml-mode)
         ("\\.yml\\'" . yaml-mode))
  :ensure t)
(add-hook 'yaml-mode-hook #'lsp)
#+END_SRC

#+RESULTS:
| lsp |

* Key Remaps

#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "M-k") 'kill-this-buffer)
(global-set-key (kbd "C-z") 'undo)
(global-set-key (kbd "C-c c r" ) 'comment-region)
(global-set-key (kbd  "C-c c u") 'uncomment-region)
(global-set-key [?\M-h] 'delete-backward-char)
(global-set-key (kbd "<f7>") 'vterm)
  #+END_SRC

  #+RESULTS:
  : vterm

* Packages

** Enmet
Baked into VS code, pretty good snippets for jsx tags.
#+BEGIN_SRC emacs-lisp
(use-package emmet-mode
  :ensure t)

(add-hook 'web-mode-hook 'emmet-mode)

(use-package helm-emmet
  :ensure t)
#+END_SRC

#+RESULTS:

** Forge

#+BEGIN_SRC emacs-lisp

(use-package forge
  :after magit)

(setq auth-sources '("~/.authinfo"))
#+END_SRC

#+RESULTS:

** Hydra
#+BEGIN_SRC emacs-lisp
(use-package hydra
  :ensure t)

#+END_SRC

#+RESULTS:

*** Flycheck
#+BEGIN_SRC emacs-lisp
(defhydra hydra-flycheck (global-map "C-c f")
  "Move around flycheck errors"
  ("n" flycheck-next-error "next")
  ("p" flycheck-previous-error "previous")
  ("f" flycheck-first-error "first")
  ("l" flycheck-list-errors "list")
  )

#+END_SRC

#+RESULTS:
: hydra-flycheck/body

*** Org Mode
#+BEGIN_SRC emacs-lisp

(defhydra hydra-org (global-map "<f1>")
  "Org"
  ("n" org-next-visible-heading "Next Heading")
  ("p" org-previous-visible-heading "Previous Heading")
  ("u" outline-up-heading "Up a level")
  ("," org-promote-subtree "Promote Subtree")
  ("." org-demote-subtree "Demote Subtree")
  ("t" org-todo "TODO")
  ("1" org-priority "Priority")
  )

#+END_SRC

#+RESULTS:
: hydra-org/body

*** SaveHist
#+BEGIN_SRC emacs-lisp
  (use-package
  savehist
  :config (setq history-length 10000))
(savehist-mode)
  #+END_SRC

** PDF-tools
make sure that you have pdf tools installed.
#+BEGIN_SRC emacs-lisp
(use-package pdf-tools
   :pin manual
   :config
   (pdf-tools-install)
   (setq-default pdf-view-display-size 'fit-width)
   (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
   :custom
   (pdf-annot-activate-created-annotations t "automatically annotate highlights"))

(setq TeX-view-program-selection '((output-pdf "PDF Tools"))
      TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
      TeX-source-correlate-start-server t)

(add-hook 'TeX-after-compilation-finished-functions
          #'TeX-revert-document-buffer)
(add-hook 'pdf-view-mode-hook (lambda() (linum-mode -1)))

  #+END_SRC

  #+RESULTS:
  | (lambda nil (linum-mode -1)) | pdf-tools-enable-minor-modes |

** Ace Window
#+BEGIN_SRC emacs-lisp
(setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
(global-set-key (kbd "M-o") 'ace-window)
#+END_SRC
** SmartParens
#+BEGIN_SRC emacs-lisp
  (use-package smartparens
      :init (sp-use-smartparens-bindings))
    (add-hook 'go-mode-hook #'smartparens-mode)
    (add-hook 'python-mode-hook #'smartparens-mode)
    (add-hook 'rust-mode-hook #'smartparens-mode)

(use-package smartparens-config
  :hook ((after-init . smartparens-global-mode))
  :init (setq sp-hybrid-kill-entire-symbol nil))

  #+END_SRC
** Rainbow Delimiters
#+BEGIN_SRC emacs-lisp

(use-package rainbow-delimiters-mode
  :defer t
  :config (add-hook 'prog-mode-hook 'text-mode-hook 'org-src-mode-hook))

  (use-package rainbow-mode
    :ensure t
    :config
    (setq rainbow-x-colors nil)
    (add-hook 'prog-mode-hook 'rainbow-mode))
  #+END_SRC

  #+RESULTS:
  : t

** DeadGrep
** Spaceline
** Yasnippet
#+BEGIN_SRC emacs-lisp
(use-package
  yasnippet
  :ensure t
  :init (yas-global-mode 1)
  :bind (("<f8>" . yas-expand-from-trigger-key))
  :config (use-package
            yasnippet-snippets
            :ensure t)
  (yas-reload-all))
(setq yas-snippet-dirs (append yas-snippet-dirs
                               '("snippets")))

#+END_SRC

#+RESULTS:
| /home/samin/.emacs.d/snippets | yasnippet-snippets-dir | snippets | snippets | snippets | snippets |

** Company
#+BEGIN_SRC emacs-lisp
(use-package
company
:ensure t
:init (add-hook 'after-init-hook 'global-company-mode)
:config (setq company-idle-delay 0)
(setq company-minimum-prefix-length 1))

(setq company-tooltip-align-annotations t)


  #+END_SRC
** Flycheck
#+BEGIN_SRC emacs-lisp
(use-package
  flycheck
  :ensure t
)

#+end_src
** Indent Tools
** Helm
*** Bibtex
#+BEGIN_SRC emacs-lisp
(setq
;; helm-bibtex-bibliography '("~/bibtex/bibs.bib")
 bibtex-completion-notes-path "~/orgs/notes/"
 bibtex-completion-bibliography "~/bibtex/bibs.bib"
 bibtex-completion-library-path "~/Zotero/"
 bibtex-completion-pdf-field "file"
 )

(global-set-key (kbd "C-h b") 'helm-bibtex)
(global-set-key (kbd "C-h g") 'helm-do-grep-ag)

  #+END_SRC

