emacs/configuration.el

(defun custom-go-hook ()

  (setq gofmt-command "goimports")
  (add-hook 'before-save-hook 'gofmt-before-save)

  ;; Key bindings specific to go-mode
  (local-set-key (kbd "M-.") 'godef-jump)         ; Go to definition
  (local-set-key (kbd "M-*") 'pop-tag-mark)       ; Return from whence you came
  (local-set-key (kbd "M-p") 'compile)            ; Invoke compiler
  (local-set-key (kbd "M-P") 'recompile)          ; Redo most recent compile cmd
  (local-set-key (kbd "M-]") 'next-error)         ; Go to next error (or msg)
  (local-set-key (kbd "M-[") 'previous-error)     ; Go to previous error or msg

  )

(setq lsp-gopls-staticcheck t)
(setq lsp-eldoc-render-all t)
(setq lsp-gopls-complete-unimported t)
(setq compilation-window-height 14)
(setq lsp-gopls-codelens nil)

(use-package go-mode :mode "\\*\\.go")
(add-hook 'go-mode-hook #'smartparens-mode)
(add-hook 'go-mode-hook 'custom-go-hook)

(add-hook 'go-mode-hook #'aggressive-indent-mode)

(defun setup-tide-mode()
  (interactive)
  (tide-setup)
  (flycheck-mode +1)
  (setq flycheck-check-syntax-automatically '(save mode-enabled))
(tide-hl-identifier-mode +1)

  (eldoc-mode +1)

  ;; company is an optional dependency. You have to
  ;; install it separately via package-install
  ;; `M-x package-install [ret] company`
  (company-mode +1))

(use-package tide
  :ensure t
  :after (rjsx-mode company flycheck)
  :hook (rjsx-mode . setup-tide-mode))

(add-hook 'before-save-hook 'tide-format-before-save)

(add-hook 'typescript-mode-hook #'setup-tide-mode)


(use-package web-mode
  :ensure t )

(setq web-mode-content-types-alist '(("jsx" . "\\.js[x]?\\'")))

(defun web-mode-init-hook ()
  "Hooks for Web mode.  Adjust indent."
  (setq web-mode-markup-indent-offset 4))

(use-package rjsx-mode
:ensure t
:mode "\\.js\\'")

(add-hook 'web-mode-hook  'web-mode-init-hook)

(add-hook 'js2-mode-hook #'setup-tide-mode)


(add-to-list 'auto-mode-alist '("\\.jsx\\'" . web-mode))
(add-hook 'web-mode-hook
          (lambda ()
            (when (string-equal "jsx" (file-name-extension buffer-file-name))
              (setup-tide-mode))))
;; configure jsx-tide checker to run after your default jsx checker
(flycheck-add-mode 'javascript-eslint 'web-mode)

(use-package add-node-modules-path
  :ensure t)
(use-package prettier
  :ensure t
)


(defun web-mode-init-prettier-hook ()
  (add-node-modules-path)
  (prettier-js-mode))

(add-hook 'web-mode-hook  'web-mode-init-prettier-hook)

(setq-default flycheck-disabled-checkers
              (append flycheck-disabled-checkers
                      '(javascript-jshint json-jsonlist)))

;; Enable eslint checker for web-mode
(flycheck-add-mode 'javascript-eslint 'web-mode)
;; Enable flycheck globally
(add-hook 'after-init-hook #'global-flycheck-mode)

(use-package cypher-mode
  :ensure t
  :mode "\\.cql")

(lsp-register-client
 (make-lsp-client :new-connection (lsp-stdio-connection '("terraform-ls" "serve"))
                  :major-modes '(terraform-mode)
                  :server-id 'terraform-ls))


(add-hook 'terraform-mode-hook #'lsp)

(use-package graphql-mode
  :ensure t
  :mode "\\.graphqls?\\'")

(use-package yaml-mode
  :mode (("\\.yaml\\'" . yaml-mode)
         ("\\.yml\\'" . yaml-mode))
  :ensure t)
(add-hook 'yaml-mode-hook #'lsp)

(define-key global-map (kbd "M-k") 'kill-this-buffer)
(global-set-key (kbd "C-z") 'undo)
(global-set-key (kbd "C-c c r" ) 'comment-region)
(global-set-key (kbd  "C-c c u") 'uncomment-region)
(global-set-key [?\M-h] 'delete-backward-char)
(global-set-key (kbd "<f7>") 'vterm)

(use-package emmet-mode
  :ensure t)

(add-hook 'web-mode-hook 'emmet-mode)

(use-package helm-emmet
  :ensure t)

(use-package forge
  :after magit)

(setq auth-sources '("~/.authinfo"))

(use-package hydra
  :ensure t)

(defhydra hydra-flycheck (global-map "C-c f")
  "Move around flycheck errors"
  ("n" flycheck-next-error "next")
  ("p" flycheck-previous-error "previous")
  ("f" flycheck-first-error "first")
  ("l" flycheck-list-errors "list")
  )

(defhydra hydra-org (global-map "<f1>")
  "Org"
  ("n" org-next-visible-heading "Next Heading")
  ("p" org-previous-visible-heading "Previous Heading")
  ("u" outline-up-heading "Up a level")
  ("," org-promote-subtree "Promote Subtree")
  ("." org-demote-subtree "Demote Subtree")
  ("t" org-todo "TODO")
  ("1" org-priority "Priority")
  )

(use-package
  savehist
  :config (setq history-length 10000))
(savehist-mode)

(use-package pdf-tools
   :pin manual
   :config
   (pdf-tools-install)
   (setq-default pdf-view-display-size 'fit-width)
   (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
   :custom
   (pdf-annot-activate-created-annotations t "automatically annotate highlights"))

(setq TeX-view-program-selection '((output-pdf "PDF Tools"))
      TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
      TeX-source-correlate-start-server t)

(add-hook 'TeX-after-compilation-finished-functions
          #'TeX-revert-document-buffer)
(add-hook 'pdf-view-mode-hook (lambda() (linum-mode -1)))

(setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
(global-set-key (kbd "M-o") 'ace-window)

(use-package smartparens
      :init (sp-use-smartparens-bindings))
    (add-hook 'go-mode-hook #'smartparens-mode)
    (add-hook 'python-mode-hook #'smartparens-mode)
    (add-hook 'rust-mode-hook #'smartparens-mode)

(use-package smartparens-config
  :hook ((after-init . smartparens-global-mode))
  :init (setq sp-hybrid-kill-entire-symbol nil))

(use-package rainbow-delimiters-mode
  :defer t
  :config (add-hook 'prog-mode-hook 'text-mode-hook 'org-src-mode-hook))

  (use-package rainbow-mode
    :ensure t
    :config
    (setq rainbow-x-colors nil)
    (add-hook 'prog-mode-hook 'rainbow-mode))

(use-package
  yasnippet
  :ensure t
  :init (yas-global-mode 1)
  :bind (("<f8>" . yas-expand-from-trigger-key))
  :config (use-package
            yasnippet-snippets
            :ensure t)
  (yas-reload-all))
(setq yas-snippet-dirs (append yas-snippet-dirs
                               '("snippets")))

(use-package
company
:ensure t
:init (add-hook 'after-init-hook 'global-company-mode)
:config (setq company-idle-delay 0)
(setq company-minimum-prefix-length 1))

(setq company-tooltip-align-annotations t)

(use-package
  flycheck
  :ensure t
)

(setq
;; helm-bibtex-bibliography '("~/bibtex/bibs.bib")
 bibtex-completion-notes-path "~/orgs/notes/"
 bibtex-completion-bibliography "~/bibtex/bibs.bib"
 bibtex-completion-library-path "~/Zotero/"
 bibtex-completion-pdf-field "file"
 )

(global-set-key (kbd "C-h b") 'helm-bibtex)
(global-set-key (kbd "C-h g") 'helm-do-grep-ag)

(use-package
  counsel
  :config
