emacs/configuration.org
** Counsel
Do I really need this? I am not sure I use this. Come back to this and revaluate
#+BEGIN_SRC emacs-lisp
(use-package
  counsel
  :config
  ;; Use virtual buffers, this adds bookmarks and recentf to the
  ;; switch-buffer function:
  (setq ivy-use-virtual-buffers t)
  ;; Candidate count format for ivy read. Show index and count.
  (setq ivy-count-format "(%d/%d) ")
  ;; I use big windows, so plenty of room for ivy mini buffer
  (setq max-mini-window-height 0.5)
  (setq ivy-height 20)
  :bind
  ;; Some standard keybindings, matching helm ones I used to have.
  (("M-s o" . 'swiper)
   ("M-x" . 'counsel-M-x)
   ("C-x C-f" . 'counsel-find-file)
   ;; These keybindings recommended by counsel docs.
   ("<f1> f" . 'counsel-describe-function)
   ("<f1> v" . 'counsel-describe-variable)
   ("<f1> l" . 'counsel-find-library)
   ("<f2> i" . 'counsel-info-lookup-symbol)
   ("<f2> u" . 'counsel-unicode-char)
   ;; use counsel to lookup bookmarks
   ("C-x r l" . 'counsel-bookmark)
   ;; Old keybindings I had from before switching to helm/ivy
   ("<f11>" . nil)
   ("<f11> s" . 'swiper)
   ("<f11> g l" . 'counsel-git-log)
   ("<f11> g b" . 'counsel-git-checkout)
   ("<f11> g a" . 'counsel-ag)
   ("C-c z p f" . 'counsel-projectile-find-file)
   ("C-c z f f" . 'counsel-find-file)
   ("C-c r" . 'ivy-resume)
   ("<f11> u" . 'counsel-unicode-char)))
#+END_SRC
** Projectile
#+BEGIN_SRC emacs-lisp
(use-package
  projectile
  :ensure t
  :config (define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map)
  (projectile-mode +1))
(use-package
  counsel-projectile
  :bind
  ;; Enable ripgrep with counsel.
  (("C-c g" . #'counsel-projectile-rg)))

(use-package
  counsel-projectile
  :bind
  ;; Enable ripgrep with counsel.
  (("C-c g" . #'counsel-projectile-rg)))

#+END_SRC
** Ivy
#+BEGIN_SRC emacs-lisp

(ivy-mode 1)
(use-package
  ivy-rich
  :init (setq ivy-rich-switch-buffer-name-max-length 100)
  (ivy-rich-mode))


#+END_SRC
** Avy
#+BEGIN_SRC emacs-lisp
  (use-package avy)

(global-set-key (kbd "C-;") 'avy-goto-char)
(global-set-key (kbd "C-'") 'avy-goto-char-2)
(global-set-key (kbd "C-#") 'avy-goto-line)

  #+END_SRC
*** Sequences
#+BEGIN_SRC emacs-lisp
(setq avy-keys
(nconc (number-sequence ?a ?z)
       (number-sequence ?A ?Z)
       (number-sequence ?1 ?9)
       '(?0)))
  #+END_SRC
** Smart Shift
#+BEGIN_SRC emacs-lisp
(use-package smart-shift
  :ensure t)

(global-smart-shift-mode 1)
(setq smart-shift-indentation-level 2)

#+END_SRC
** Highlight Indentation
#+BEGIN_SRC emacs-lisp
(use-package highlight-indent-guides
  :ensure t)

(add-hook 'yaml-mode-hook 'highlight-indent-guides-mode)


#+END_SRC
** Multiple Cursors
#+BEGIN_SRC emacs-lisp
(use-package multiple-cursors
  :ensure t)

#+END_SRC
* Lsp
** Meat and Bones
#+BEGIN_SRC emacs-lisp
    (use-package
      lsp-mode
      :ensure t

      :config (add-hook 'python-mode-hook #'lsp)
      (add-hook 'go-mode-hook #'lsp)
      (add-hook 'rust-mode-hook #'lsp)
      (add-hook 'terraform-mode #'lsp))
#+END_SRC
** Sideline

#+BEGIN_SRC emacs-lisp
(setq lsp-sideline-show-hover t)
(setq)

#+END_SRC

#+RESULTS:
: t

** UI
Things to consider, we could have the LSP UI doc disables and then just have a key binding to fire it off when we need.
#+BEGIN_SRC emacs-lisp
(use-package
  lsp-ui
  :ensure t
  :commands lsp-ui-mode
  :init)

(setq lsp-ui-doc-enable t lsp-ui-peek-enable t lsp-ui-sideline-enable t lsp-ui-imenu-enable t
      lsp-ui-flycheck-enable t lsp-ui-sideline-toggle-symbols-info t)

(setq lsp-ui-doc-position 'bottom)
(setq lsp-enable-symbol-highlighting t)
(setq lsp-lens-enable t)
(setq lsp-modeline-code-actions-enable t)
(setq lsp-diagnostics-provider :auto)

#+END_SRC

#+RESULTS:
: :auto

** Tuning
#+BEGIN_SRC emacs-lisp
  (setq gc-cons-threshold 200000000)
  (setq read-process-output-max ( * 1024 1024) )
  (setq lsp-prefer-capf t)


  #+END_SRC
** Ignore Files
#+BEGIN_SRC emacs-lisp
    (add-to-list 'lsp-file-watch-ignored "[/\\\\]build$")
    (add-to-list 'lsp-file-watch-ignored "[/\\\\]data")
    (add-to-list 'lsp-file-watch-ignored "[/\\\\]venv")
  #+END_SRC
** Smex
#+BEGIN_SRC emacs-lisp
  (use-package smex)
  #+END_SRC
* Jira

# #+BEGIN_SRC emacs-lisp


# (use-package ejira
#   :init
#   (setq jiralib2-url              "https://jira.mycorp.com"
#         jiralib2-auth             'basic
#         jiralib2-user-login-name  "my-jira-username"
#         jiralib2-token            nil

#         ejira-org-directory       "~/jira"
#         ejira-projects            '("EJ" "JL2")

#         ejira-priorities-alist    '(("Highest" . ?A)
#                                     ("High"    . ?B)
#                                     ("Medium"  . ?C)
#                                     ("Low"     . ?D)
#                                     ("Lowest"  . ?E))
#         ejira-todo-states-alist   '(("To Do"       . 1)
#                                     ("In Progress" . 2)
#                                     ("Done"        . 3)))
#   :config
#   ;; Tries to auto-set custom fields by looking into /editmeta
#   ;; of an issue and an epic.
#   (add-hook 'jiralib2-post-login-hook #'ejira-guess-epic-sprint-fields)

#   ;; They can also be set manually if autoconfigure is not used.
#   ;; (setq ejira-sprint-field       'customfield_10001
#   ;;       ejira-epic-field         'customfield_10002
#   ;;       ejira-epic-summary-field 'customfield_10004)

#   (require 'ejira-agenda)

#   ;; Make the issues visisble in your agenda by adding `ejira-org-directory'
#   ;; into your `org-agenda-files'.
#   (add-to-list 'org-agenda-files ejira-org-directory)

#   ;; Add an agenda view to browse the issues that
#   (org-add-agenda-custom-command
#    '("j" "My JIRA issues"
#      ((ejira-jql "resolution = unresolved and assignee = currentUser()"
#                  ((org-agenda-overriding-header "Assigned to me")))))))
# #+END_SRC

#+RESULTS:
: t

* Org

What a package. Game changer.

#+BEGIN_SRC emacs-lisp

;; (setq org-format-latex-options (plist-put org-format-latex-options :scale 3.5 ))

#+END_SRC

#+RESULTS:
| :foreground | default | :background | default | :scale | 3.5 | :html-foreground | Black | :html-background | Transparent | :html-scale | 1.0 | :matchers | (begin $1 $ $$ \( \[) |

** Agenda

#+BEGIN_SRC emacs-lisp
(use-package org-super-agenda
  :ensure t
  :after org-agenda
  :init
  (setq org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-agenda-include-deadlines t
      org-agenda-block-separator nil
      org-agenda-compact-blocks t
      Org-agenda-start-day nil ;; i.e. today
      org-agenda-span 1
      org-agenda-start-on-weekday nil)

  (setq org-agenda-custom-commands
        '(("c" "Super view"
           ((agenda "" ((org-agenda-overriding-header "")
                        (org-super-agenda-groups
                         '((:name "Today"
                                  :time-grid t
                                  :date today
                                  :order 1)))))
            (alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:log t)
                            (:name "To refile"
                                   :file-path "orgs/tickler\\.org")
                            (:name "Next to do"
                                   :todo "NEXT"
                                   :order 1)
                            (:name "Important"
                                   :priority "A"
                                   :order 6)
                            (:name "Today's tasks"
                                   :file-path "journal/")
                            (:name "Due Today"
                                   :deadline today
                                   :order 2)
                            (:name "Scheduled Soon"
                                   :scheduled future
                                   :order 8)
                            (:name "Overdue"
                                   :deadline past
                                   :order 7)
                            (:name "Meetings"
                                   :and (:todo "MEET" :scheduled future)
                                   :order 10)
                            (:discard (:not (:todo "TODO")))))))))))

  :config
  (org-super-agenda-mode)
  )
(setq org-agenda-files (list "~/orgs/gtd.org" "~/orgs/code.org" "~/orgs/journal.org"))
#+END_SRC

#+RESULTS:

** Capture
*** Init
#+BEGIN_SRC emacs-lisp
   (setq org-capture-templates '(("t" "Todo [Inbox]" entry (file+headline "~/orgs/gtd.org" "Tasks")
                                   "* TODO %?\n  %i\n ")
                                  ("c" "Code" entry (file+headline "~/orgs/code.org" "Code")
                                   "* TODO %?\n %i\n %a")
                                  ("j" "Journal" entry (file+datetree "~/orgs/journal.org")
                                   "* %?\nEntered on %U\n  %i\n  %a")
                                  ("T" "Tickler" entry (file+headline "~/orgs/tickler.org" "Tickler")
                                   "* %i%? \n %U")))

  (setq org-refile-targets (quote (("~/orgs/tickler.org" :maxlevel . 3)
                                   ("~/orgs/gtd.org" :level . 2)
                                   ("~/orgs/someday.org" :level . 1))))


#+END_SRC

#+RESULTS:
: ((~/orgs/tickler.org :maxlevel . 3) (~/orgs/gtd.org :level . 2) (~/orgs/someday.org :level . 1))

