emacs/configuration.org
*** Shortcuts
#+BEGIN_SRC emacs-lisp
  (define-key global-map (kbd "C-c o")
  (lambda ()
    (interactive)
    (org-capture)))
(define-key global-map (kbd "C-c a")
  (lambda ()
    (interactive)
    (org-agenda)))



  #+END_SRC

  #+RESULTS:

** Roam
*** Init
#+BEGIN_SRC emacs-lisp
(use-package org-roam
      :ensure t
      :hook
      ((after-init . org-roam-mode )
       'org-roam-server-mode)
      :custom
      (org-roam-directory "~/orgs/roam")
      :bind (:map org-roam-mode-map
              (("C-c n l" . org-roam)
               ("C-c n f" . org-roam-find-file)
               ("C-c n g" . org-roam-graph-show)
               )
              :map org-mode-map
              (("C-c n i" . org-roam-insert))
              (("C-c n I" . org-roam-insert-immediate)))
      )
  #+END_SRC
*** Templates
#+BEGIN_SRC emacs-lisp
(setq org-roam-capture-templates
        '(("d" "default" plain
           (function org-roam-capture--get-point)
           "%?"
           :file-name "%<%Y%m%d%H%M%S>-${slug}"
           :head "#+title: ${title}\n#+ROAM_TAGS:\n#+created: %u\n#+last_modified: %U\n\n\n\n"
           :unnarrowed t))

        )
  #+END_SRC

** Roam Server
#+BEGIN_SRC emacs-lisp
  (use-package org-roam-server
  :ensure t
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 8081
        org-roam-server-authenticate nil
        org-roam-server-export-inline-images t
        org-roam-server-serve-files nil
        org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
        org-roam-server-network-poll t
        org-roam-server-network-arrows nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60
        org-roam-server-network-label-wrap-length 20))

(server-start)
  #+END_SRC
** Roam Bibtex
#+BEGIN_SRC emacs-lisp

(use-package org-roam-bibtex
:requires bibtex-completion
:load-path "~/bibtex/bibs.bib" ;Modify with your own path
:hook (org-roam-mode . org-roam-bibtex-mode)
:bind (:map org-mode-map
            (("C-c n a" . orb-note-actions)))
 )

(add-hook 'after-init-hook #'org-roam-bibtex-mode)

  #+END_SRC

  #+RESULTS:
  | org-roam-bibtex-mode | global-flycheck-mode | org-roam-mode | global-company-mode | smartparens-global-mode | #[0 \300 \207 [dashboard-insert-startupify-lists] 1] | global-hl-line-mode | x-wm-set-size-hint | tramp-register-archive-file-name-handler | table--make-cell-map |

*** Templates
#+BEGIN_SRC emacs-lisp

(setq orb-preformat-keywords   '(("citekey" . "=key=") "title" "url" "file" "author-or-editor" "keywords"))

  (defvar orb-title-format "${author-or-editor-abbrev} (${date}).  ${title}."
        "Format of the title to use for `orb-templates'.")

(setq orb-templates  `(
      ("r" "ref" plain
      (function org-roam-capture--get-point)
      ""
      :file-name "refs/${citekey}"
      :head ,(s-join "\n"
                     (list
                      (concat "#+title: "
                              orb-title-format)
                      "#+roam_key: ${ref}"
                      "#+created: %U"
                      "#+last_modified: %U\n\n"))
      :unnarrowed t)

     ("n" "ref + noter" plain
      (function org-roam-capture--get-point)
      ""
      :file-name "refs/${citekey}"
      :head ,(s-join "\n"
                     (list
                      "#+title:${title}."
                      "#+ROAM_TAGS:"
                      "#+roam_key: ${ref}"
                      ""
                      "* Notes :noter:"
                      ":PROPERTIES:"
                      ":NOTER_DOCUMENT: %(orb-process-file-field \"${citekey}\")"
                      ":NOTER_PAGE:"
                      ":END:\n\n")))))
  #+END_SRC

  #+RESULTS:
  | r | ref | plain | #'org-roam-capture--get-point |   | :file-name | refs/${citekey} | :head | #+title: ${author-or-editor-abbrev} (${date}).  ${title}. |

** Ref
*** Init
#+BEGIN_SRC emacs-lisp

(use-package org-ref
    :config
    (setq
         org-ref-completion-library 'org-ref-ivy-cite
         org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex
         org-ref-default-bibliography (list "~/bibtex/bibs.bib")
         org-ref-bibliography-notes "~/orgs/bibnotes.org"
         org-ref-note-title-format "* TODO %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"
         org-ref-notes-directory "~/orgs/notes/"

    ))


  #+END_SRC
*** Templates
#+BEGIN_SRC emacs-lisp
(setq org-roam-capture-ref-templates
      '(("roam" "ref" plain (function org-roam-capture--get-point)
         "%?"
         :file-name "web/${slug}"
         :head "#+TITLE: ${title}
#+ROAM_KEY: ${ref}
#+ROAM_ALIAS:
#+ROAM_TAGS: Link
#+Created: %u
#+LAST_MODIFIED: %U

"
         :unnarrowed t)))


  #+END_SRC
** Protocol
#+BEGIN_SRC emacs-lisp
  (require 'org-roam-protocol)
  #+END_SRC
** Noter
*** Init
#+BEGIN_SRC emacs-lisp

(use-package org-noter
  :after (:any org pdf-view)
  :config
(pdf-tools-install)

 (defun zp/org-noter-indirect (arg)
    "Ensure that org-noter starts in an indirect buffer.
Without this wrapper, org-noter creates a direct buffer
restricted to the notes, but this causes problems with the refile
system.  Namely, the notes buffer gets identified as an
agenda-files buffer.
This wrapper addresses it by having org-noter act on an indirect
buffer, thereby propagating the indirectness."
    (interactive "P")
    (if (org-entry-get nil org-noter-property-doc-file)
        (with-selected-window (zp/org-tree-to-indirect-buffer-folded nil t)
          (org-noter arg)
          (kill-buffer))
      (org-noter arg)))


(require 'org-noter-pdftools)
  (setq
   ;; Please stop opening frames
   org-noter-always-create-frame nil
   ;; I want to see the whole file
   org-noter-hide-other t
   ;; Everything is relative to the main notes file
   org-noter-notes-search-path "~/orgs/"

   org-noter-auto-save-last-location nil
   )
  :ensure t
  )

(use-package org-pdftools
  :hook (org-mode . org-pdftools-setup-link))

(use-package org-noter-pdftools
  :after org-noter
  :config
  ;; Add a function to ensure precise note is inserted
  (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
    (interactive "P")
    (org-noter--with-valid-session
     (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                   (not org-noter-insert-note-no-questions)
                                                 org-noter-insert-note-no-questions))
           (org-pdftools-use-isearch-link t)
           (org-pdftools-use-freestyle-annot t))
       (org-noter-insert-note (org-noter--get-precise-info)))))

  ;; fix https://github.com/weirdNox/org-noter/pull/93/commits/f8349ae7575e599f375de1be6be2d0d5de4e6cbf
  (defun org-noter-set-start-location (&optional arg)
    "When opening a session with this document, go to the current location.
With a prefix ARG, remove start location."
    (interactive "P")
    (org-noter--with-valid-session
     (let ((inhibit-read-only t)
           (ast (org-noter--parse-root))
           (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
       (with-current-buffer (org-noter--session-notes-buffer session)
         (org-with-wide-buffer
          (goto-char (org-element-property :begin ast))
          (if arg
              (org-entry-delete nil org-noter-property-note-location)
            (org-entry-put nil org-noter-property-note-location
                           (org-noter--pretty-print-location location))))))))
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))
  #+END_SRC

  #+RESULTS:
  : t
***

*** PDF Tools integration
#+BEGIN_SRC emacs-lisp

;; (use-package org-pdftools
;;   :hook (org-mode . org-pdftools-setup-link))

;; (use-package org-noter-pdftools
;;   :after org-noter
;;   :config
;;   (with-eval-after-load 'pdf-annot
;;     (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))


  #+END_SRC

  #+RESULTS:
  : t

** Deft
#+BEGIN_SRC emacs-lisp
  (use-package deft
      :after org
      :bind
      ("C-c n d" . deft)
      :custom
      (deft-recursive t)
      (deft-use-filter-string-for-filename t)
      (deft-default-extension "org")
      (deft-directory "~/orgs/"))

  #+END_SRC
