emacs/configuration.org
** Download
This needs further configuring. Not happy with the way that it processes images and so have stopped using it.
#+BEGIN_SRC emacs-lisp
  (require 'org-download)
  #+END_SRC
** Journal
Better than Dailies in my opinion, and also separate to your personal roam graphs
#+BEGIN_SRC emacs-lisp
(use-package org-journal)

  #+END_SRC
** Trello

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.trello$" . org-mode))

(custom-set-variables '(org-trello-files '("~/orgs/am4.trello")))
#+END_SRC

#+RESULTS:
** Jupyter
#+BEGIN_SRC emacs-lisp
(use-package jupyter
  :commands (jupyter-run-server-repl
             jupyter-run-repl
             jupyter-server-list-kernels))

(setq org-babel-jupyter-override-src-block "python")
(setq jupyter-eval-use-overlays 1)

#+END_SRC

#+RESULTS:
: 1
** Babel
#+BEGIN_SRC emacs-lisp
(use-package jupyter

  :ensure nil
  :config (progn
            (org-babel-do-load-languages
             'org-babel-load-languages
             '((python . t)
               (jupyter . t)))))
#+END_SRC

#+RESULTS:
: t
** Publish
#+BEGIN_SRC emacs-lisp
(setq org-publish-project-alist
  '(("html"
     :base-directory "~/org/"
     :base-extension "org"
     :publishing-directory "~/org-exports/"
     :publishing-function org-publish-org-to-html)
    ("pdf"
     :base-directory "~/org/"
     :base-extension "org"
     :publishing-directory "~/org-exports/"
     :publishing-function org-publish-org-to-pdf)
    ("all" :components ("html" "pdf"))))
#+END_SRC

#+RESULTS:
| html | :base-directory | ~/org/     | :base-extension | org | :publishing-directory | ~/org-exports/ | :publishing-function | org-publish-org-to-html |
| pdf  | :base-directory | ~/org/     | :base-extension | org | :publishing-directory | ~/org-exports/ | :publishing-function | org-publish-org-to-pdf  |
| all  | :components     | (html pdf) |                 |     |                       |                |                      |                         |
** Xournal-PP
For note taking with a tablet and integrating them with my Org Mode workflow.
#+BEGIN_SRC emacs-lisp
(quelpa
 '(quelpa-use-package
   :fetcher git
   :url "https://github.com/quelpa/quelpa-use-package.git"))
(require 'quelpa-use-package)

(
 use-package org-xournalpp
             :ensure t
             :quelpa (org-xournalpp :fetcher gitlab :repo "vherrmann/org-xournalpp" :files ("*.el" "resources"))
             :config
             (add-hook 'org-mode-hook 'org-xournalpp-mode)

 )
#+END_SRC

#+RESULTS:
: t
