emacs/configuration.el

(require 'org-download)

(use-package org-journal)

(add-to-list 'auto-mode-alist '("\\.trello$" . org-mode))

(custom-set-variables '(org-trello-files '("~/orgs/am4.trello")))

(use-package jupyter
  :commands (jupyter-run-server-repl
             jupyter-run-repl
             jupyter-server-list-kernels))

(setq org-babel-jupyter-override-src-block "python")
(setq jupyter-eval-use-overlays 1)

(use-package jupyter

  :ensure nil
  :config (progn
            (org-babel-do-load-languages
             'org-babel-load-languages
             '((python . t)
               (jupyter . t)))))

(setq org-publish-project-alist
  '(("html"
     :base-directory "~/org/"
     :base-extension "org"
     :publishing-directory "~/org-exports/"
     :publishing-function org-publish-org-to-html)
    ("pdf"
     :base-directory "~/org/"
     :base-extension "org"
     :publishing-directory "~/org-exports/"
     :publishing-function org-publish-org-to-pdf)
    ("all" :components ("html" "pdf"))))

(quelpa
 '(quelpa-use-package
   :fetcher git
   :url "https://github.com/quelpa/quelpa-use-package.git"))
(require 'quelpa-use-package)

(
 use-package org-xournalpp
             :ensure t
             :quelpa (org-xournalpp :fetcher gitlab :repo "vherrmann/org-xournalpp" :files ("*.el" "resources"))
             :config
             (add-hook 'org-mode-hook 'org-xournalpp-mode)

 )
